;;项目目录
SYSTEM_DIR=%A_ScriptDir%

;;项目利用的执行文件目录
BIN_DIR=%SYSTEM_DIR%\bin

;;绑定的热键，对应的执行程序
;----------------------------------快捷打开隐藏--------win+?-------------------------------------------------
#b::
   ;打开隐藏任务栏 win+b
   run ,%BIN_DIR%\SHwinbar.pyw 
   return ;;结束代码段
  
#Enter::
   ;时间规划表 win+enter(非小键盘) 
   run,%BIN_DIR%\Excel_MYPLANS.ahk 
   return ;;结束代码段   
;-------------------------- 一定需要思考一下才打开的 win+alt+？-----------------------------------------------------------------
#!Numpad0::
   ;打开回收站 win+alt+0（小键盘）
   Run ,%BIN_DIR%\recycleBin.ahk  ;打开回收站。
   return ;;结束代码段
   

;-------------------------------------------------------------------------------------------
;重命名
#v::F2
;-------------------------------------------------------------------------------------------  
F11:: 
   ;退出 F11
   exitapp
   return ;;结束代码段